wuxx/nanoCH32V203/doc/EVT/EXAM/USB/USBFS/HOST_Udisk/EXAM13/User/ch32vf20x_usbotg_host.h
#define R8_UH_EP_PID        R8_UEP2_T_LEN               // host endpoint and PID
#define     MASK_UH_TOKEN       0xF0      // bit mask of token PID for USB host transfer
#define     MASK_UH_ENDP        0x0F      // bit mask of endpoint number for USB host transfer

#define R8_UH_RX_CTRL       R8_UEP2_CTRL                // host receiver endpoint control
#define     RB_UH_R_TOG         0x80      // expected data toggle flag of host receiving (IN): 0=DATA0, 1=DATA1
#define     RB_UH_R_AUTO_TOG    0x10      // enable automatic toggle after successful transfer completion: 0=manual toggle, 1=automatic toggle
#define     RB_UH_R_RES         0x04      // prepared handshake response type for host receiving (IN): 0=ACK (ready), 1=no response, time out to device, for isochronous transactions

#define R32_USB_EP3_CTRL    (*((PUINT32V)(0x4002343c))) // endpoint 3 control & transmittal length
#define R8_UEP3_T_LEN       (*((PUINT16V)(0x4002343c))) // endpoint 3 transmittal length
#define R8_UEP3_CTRL        (*((PUINT8V)(0x4002343e)))  // endpoint 3 control
#define R8_UH_TX_LEN        (*((PUINT16V)(0x4002343c)))     //R8_UEP3_T_LEN             // host transmittal endpoint transmittal length

#define R8_UH_TX_CTRL       R8_UEP3_CTRL                // host transmittal endpoint control
#define     RB_UH_T_TOG         0x40      // prepared data toggle flag of host transmittal (SETUP/OUT): 0=DATA0, 1=DATA1
#define     RB_UH_T_AUTO_TOG    0x10      // enable automatic toggle after successful transfer completion: 0=manual toggle, 1=automatic toggle
#define     RB_UH_T_RES         0x01      // expected handshake response type for host transmittal (SETUP/OUT): 0=ACK (ready), 1=no response, time out from device, for isochronous transactions

#define R32_USB_EP4_CTRL    (*((PUINT32V)(0x40023440))) // endpoint 4 control & transmittal length
#define R8_UEP4_T_LEN       (*((PUINT8V)(0x40023440)))  // endpoint 4 transmittal length
#define R8_UEP4_CTRL        (*((PUINT8V)(0x40023442)))  // endpoint 4 control

#define R32_USB_EP5_CTRL    (*((PUINT32V)(0x40023444))) // endpoint 5 control & transmittal length
#define R8_UEP5_T_LEN       (*((PUINT8V)(0x40023444)))  // endpoint 5 transmittal length
#define R8_UEP5_CTRL        (*((PUINT8V)(0x40023446)))  // endpoint 5 control

#define R32_USB_EP6_CTRL    (*((PUINT32V)(0x40023448))) // endpoint 6 control & transmittal length
#define R8_UEP6_T_LEN       (*((PUINT8V)(0x40023448)))  // endpoint 6 transmittal length
#define R8_UEP6_CTRL        (*((PUINT8V)(0x4002344a)))  // endpoint 6 control

#define R32_USB_EP7_CTRL    (*((PUINT32V)(0x4002344c))) // endpoint 7 control & transmittal length
#define R8_UEP7_T_LEN       (*((PUINT8V)(0x4002344c)))  // endpoint 7 transmittal length
#define R8_UEP7_CTRL        (*((PUINT8V)(0x4002344e)))  // endpoint 7 control

#define USE_SYS_CLK        0

/******************************************************************************/
/* USBOTG_FS DEVICE USB_CONTROL */
/* BASE USB_CTRL */
//#define USBHD_BASE_CTRL     (*((PUINT32V)(0x50000000))) // USB control & interrupt enable & device address
#define USBHD_BASE_CTRL         (*((PUINT8V)(0x50000000)))  // USB base control
#define     USBHD_UC_HOST_MODE     0x80      // enable USB host mode: 0=device mode, 1=host mode
#define     USBHD_UC_LOW_SPEED     0x40      // enable USB low speed: 0=12Mbps, 1=1.5Mbps
#define     USBHD_UC_DEV_PU_EN     0x20      // USB device enable and internal pullup resistance enable
#define     USBHD_UC_SYS_CTRL1     0x20      // USB system control high bit
#define     USBHD_UC_SYS_CTRL0     0x10      // USB system control low bit
#define     USBHD_UC_SYS_CTRL_MASK    0x30      // bit mask of USB system control
// bUC_HOST_MODE & bUC_SYS_CTRL1 & bUC_SYS_CTRL0: USB system control
//   0 00: disable USB device and disable internal pullup resistance
//   0 01: enable USB device and disable internal pullup resistance, need external pullup resistance
//   0 1x: enable USB device and enable internal pullup resistance
//   1 00: enable USB host and normal status
//   1 01: enable USB host and force UDP/UDM output SE0 state
//   1 10: enable USB host and force UDP/UDM output J state
//   1 11: enable USB host and force UDP/UDM output resume or K state
#define     USBHD_UC_INT_BUSY      0x08      // enable automatic responding busy for device mode or automatic pause for host mode during interrupt flag UIF_TRANSFER valid
#define     USBHD_UC_RESET_SIE     0x04      // force reset USB SIE, need software clear
#define     USBHD_UC_CLR_ALL       0x02      // force clear FIFO and count of USB
#define     USBHD_UC_DMA_EN        0x01      // DMA enable and DMA interrupt enable for USB

#define USBHD_UDEV_CTRL        (*((PUINT8V)(0x50000001)))  // USB device physical prot control
#define     USBHD_UD_PD_DIS        0x80      // disable USB UDP/UDM pulldown resistance: 0=enable pulldown, 1=disable
#define     USBHD_UD_DP_PIN        0x20      // ReadOnly: indicate current UDP pin level
#define     USBHD_UD_DM_PIN        0x10      // ReadOnly: indicate current UDM pin level
#define     USBHD_UD_LOW_SPEED     0x04      // enable USB physical port low speed: 0=full speed, 1=low speed
#define     USBHD_UD_GP_BIT        0x02      // general purpose bit
#define     USBHD_UD_PORT_EN       0x01      // enable USB physical port I/O: 0=disable, 1=enable


#define USBHD_UHOST_CTRL     (*((PUINT8V)(0x50000001)))      // USB host physical prot control
#define     USBHD_UH_PD_DIS        0x80      // disable USB UDP/UDM pulldown resistance: 0=enable pulldown, 1=disable
#define     USBHD_UH_DP_PIN        0x20      // ReadOnly: indicate current UDP pin level
#define     USBHD_UH_DM_PIN        0x10      // ReadOnly: indicate current UDM pin level
#define     USBHD_UH_LOW_SPEED     0x04      // enable USB port low speed: 0=full speed, 1=low speed
#define     USBHD_UH_BUS_RESET     0x02      // control USB bus reset: 0=normal, 1=force bus reset
#define     USBHD_UH_PORT_EN       0x01      // enable USB port: 0=disable, 1=enable port, automatic disabled if USB device detached

