wuxx/nanoCH32V203/doc/EVT/EXAM/USB/USBFS/HOST_Udisk/EXAM13/User/ch32vf20x_usbotg_host.h
#define USBHD_UEP5_T_LEN       (*((PUINT8V)(0x50000044)))  // endpoint 5 transmittal length
#define USBHD_UEP5_TX_CTRL     (*((PUINT8V)(0x50000046)))  // endpoint 5 tx control
#define USBHD_UEP5_RX_CTRL     (*((PUINT8V)(0x50000047)))  // endpoint 5 rx control

#define USBHD_UEP6_T_LEN       (*((PUINT8V)(0x50000048)))  // endpoint 6 transmittal length
#define USBHD_UEP6_TX_CTRL     (*((PUINT8V)(0x5000004a)))  // endpoint 6 tx control
#define USBHD_UEP6_RX_CTRL     (*((PUINT8V)(0x5000004b)))  // endpoint 6 rx control


#define USBHD_UEP7_T_LEN       (*((PUINT8V)(0x5000004c)))  // endpoint 7 transmittal length
#define USBHD_UEP7_TX_CTRL     (*((PUINT8V)(0x5000004e)))  // endpoint 7 tx control
#define USBHD_UEP7_RX_CTRL     (*((PUINT8V)(0x5000004f)))  // endpoint 7 rx control



#define  USB_OTG_CR           (*((PUINT32V)(0x50000054)))  // usb otg control
#define     USB_OTG_CR_SESS           0x20               // usb otg control,�Ự��ƽʹ��
#define     USB_OTG_CR_VBUS           0x10               // usb otg control,VBUS��ƽʹ��
#define     USB_OTG_CR_OTG_EN         0x08               // usb otg control,OTG����ʹ��
#define     USB_OTG_CR_IDPU           0x04               // usb otg control,ID��������
#define     USB_OTG_CR_CHARGEVBUS     0x02               // usb otg control,VBUS���
#define     USB_OTG_CR_DISCHARGEVBUS  0x01               // usb otg control,VBUS�ŵ�

#define  USB_OTG_SR          (*((PUINT32V)(0x50000058)))  // usb otg status
#define     USB_OTG_SR_VBUS_VLD       0x01               // usb otg status,A�豸VBUS�����ƽ��Ч
#define     USB_OTG_SR_SESS_VLD       0x02               // usb otg status,�Ự��Ч��ƽ��Ч��־
#define     USB_OTG_SR_SESS_END       0x04               // usb otg status,�Ự������ƽ��Ч��־
#define     USB_OTG_SR_ID_DIG         0x08               // usb otg status,ID��ƽ


/* USBHS PHY Clock Config (RCC_CFGR2) ʹ��USBHS PHYʱ�ӵ�����£���Ҫ�õ���Щ�궨�� */
#ifndef  USBHS_EXIST
#define USB_48M_CLK_SRC_MASK   (1<<31)
#define USB_48M_CLK_SRC_SYS    (0<<31)
#define USB_48M_CLK_SRC_PHY    (1<<31)

#define USBHS_PLL_ALIVE        (1<<30)

#define USBHS_PLL_CKREF_MASK   (3<<28)
#define USBHS_PLL_CKREF_3M     (0<<28)
#define USBHS_PLL_CKREF_4M     (1<<28)
#define USBHS_PLL_CKREF_8M     (2<<28)
#define USBHS_PLL_CKREF_5M     (3<<28)

#define USBHS_PLL_SRC_MASK     (1<<27)
#define USBHS_PLL_SRC_HSE      (0<<27)
#define USBHS_PLL_SRC_HSI      (1<<27)

#define USBHS_PLL_SRC_PRE_MASK (7<<24)
#define USBHS_PLL_SRC_PRE_DIV1 (0<<24)
#define USBHS_PLL_SRC_PRE_DIV2 (1<<24)
#define USBHS_PLL_SRC_PRE_DIV3 (2<<24)
#define USBHS_PLL_SRC_PRE_DIV4 (3<<24)
#define USBHS_PLL_SRC_PRE_DIV5 (4<<24)
#define USBHS_PLL_SRC_PRE_DIV6 (5<<24)
#define USBHS_PLL_SRC_PRE_DIV7 (6<<24)

#define DEF_USB_FS_EP_SIZE      64
#endif

#define RCC_USBFS_CLK_DIV_1   (0<<22)
#define RCC_USBFS_CLK_DIV_2   (1<<22)
#define RCC_USBFS_CLK_DIV_3   (2<<22)
#define RCC_USBFS_CLK_SRC     (1<<31)

#ifndef __PACKED
#define __PACKED            __attribute__((packed))
#endif

typedef struct  USB_STATUS
{
    UINT8   DeviceStatus;
    UINT8   DeviceAddress;
    UINT8   DeviceSpeed;
    UINT8   DeviceType;
    UINT8   DeviceEndp0Size;
    UINT8   DeviceCongValue;
    struct
    {
        UINT8   InEndpNum;
        UINT8   InEndpCount;
        UINT8   InTog;
        UINT16  InEndpMaxSize;
        UINT8   OutEndpNum;
        UINT8   OutTog;
        UINT8   OutEndpCount;
        UINT16  OutEndpMaxSize;
        UINT32  NumOfSec;
        UINT16  SecSize;
        UINT8   MaxLun;
    }DEVENDP;
}USBHS_HOST,*PUSBHS_HOST;

#define ERR_SUCCESS          0x00
#define ERR_USB_CONNECT      0x15
#define ERR_USB_DISCON       0x16
#define ERR_USB_BUF_OVER     0x17
#define ERR_USB_DISK_ERR     0x1F
#define ERR_USB_TRANSFER     0x20
#define ERR_USB_UNSUPPORT    0xFB
#define ERR_USB_UNKNOWN      0xFE
#define ERR_AOA_PROTOCOL     0x41

#define ROOT_DEV_DISCONNECT  0
#define ROOT_DEV_CONNECTED   1
#define ROOT_DEV_FAILED      2
#define ROOT_DEV_SUCCESS     3
#define DEV_TYPE_KEYBOARD   ( USB_DEV_CLASS_HID | 0x20 )
#define DEV_TYPE_MOUSE      ( USB_DEV_CLASS_HID | 0x30 )
#define DEF_AOA_DEVICE       0xF0
#define DEV_TYPE_UNKNOW      0xFF

#define HUB_MAX_PORTS           4
#define WAIT_USB_TOUT_200US     3000


#define USBOTG_EP1          1
#define USBOTG_EP2          2
#define USBOTG_EP3          3
#define USBOTG_EP4          4
#define USBOTG_EP5          5
#define USBOTG_EP6          6
#define USBOTG_EP7          7
/*******************变量外扩*******************/
extern UINT8 FoundNewDev;
extern __attribute__ ((aligned(4))) UINT8   RxBuffer[ ];  // IN, must even address
extern __attribute__ ((aligned(4))) UINT8   TxBuffer[ ];  // OUT, must even address

extern UINT32 HOST_TX_RAM_Addr;
extern UINT32 HOST_RX_RAM_Addr;

/*******************功能外扩*******************/
extern void  OTG_RCC_Init(void);
extern void  USBOTG_HostInit(FunctionalState stus);
extern void  DisableRootHubPort(void);
extern UINT8 AnalyzeRootHub(void);
extern void  SetHostUsbAddr(UINT8 addr);
extern void  SetUsbSpeed(UINT8 FullSpeed);
extern void  ResetRootHubPort(void);
extern UINT8 EnableRootHubPort(void);
extern UINT8 WaitUSB_Interrupt(void);
extern UINT8 USBHostTransact(UINT8 endp_pid, UINT8 tog, UINT32 timeout);
extern UINT8 HostCtrlTransfer(PUINT8 DataBuf, PUINT8 RetLen);
extern void  CopySetupReqPkg( const UINT8 *pReqPkt);
extern UINT8 CtrlGetDeviceDescr(PUINT8 DataBuf);
extern UINT8 CtrlGetConfigDescr(PUINT8 DataBuf);
extern UINT8 CtrlSetUsbAddress(UINT8 addr);
extern UINT8 CtrlSetUsbConfig(UINT8 cfg);
extern UINT8 CtrlClearEndpStall(UINT8 endp);
extern UINT8 CtrlSetUsbIntercace(UINT8 cfg);
//extern UINT8 USBOTG_HostEnum(void);
extern UINT8 USBOTG_HostEnum( UINT8 *buf );
extern UINT8 HubGetPortStatus(UINT8 HubPortIndex);
extern UINT8 HubSetPortFeature(UINT8 HubPortIndex, UINT8 FeatureSelt);
extern UINT8 HubClearPortFeature(UINT8 HubPortIndex, UINT8 FeatureSelt);


#endif

